import colorama
colorama.init(autoreset=True)

BLUE = colorama.Fore.BLUE
RED = colorama.Fore.RED
GREEN = colorama.Fore.GREEN
YELLOW = colorama.Fore.YELLOW
MAGENTA = colorama.Fore.MAGENTA
CYAN = colorama.Fore.CYAN
LIGHTYELLOW_EX = colorama.Fore.LIGHTYELLOW_EX

print(f"{BLUE} Ти охоронець на науковому комплексі Чорна Меза.")
print(f"{BLUE} Ти стоїш на блок-пості зі своїм напарником Олексієм.")
print(f"{BLUE} Раптом лунає потужний взрив який накриває все по всюду, та ти відключаєшся.")

print(f"{BLUE} Раптом ти прокидаєшся у крові, поруч з тобою пістолет Глок-17 та твій мертвий напарник.")
print(f"{BLUE} Твої дії від одного до трьох: \n")
    

def full_game():

    while True:
        print(f"{RED}1. Взяти пістолет та втекти з блок-поста.")
        print(f"{GREEN}2. Вистрілити у себе в голову.")
        print(f"{YELLOW}3. Не брати пістолет та втекти у сам комплекс. \n")
    
        choise = input(f"{MAGENTA}Введи цифри від одного до трьох: \n")
    
        if choise == "1":
            print(f"{CYAN}Ти добіг до оружейного складу та побачив військового HECU.")
            scientist()
            break
        
        elif choise == "2":
            print(f"{RED}Ти не зміг собі вистрілити у голову так як там заклінив, але тебе потім вбив повторний вибух.")
            exit()
        
        elif choise == "3":
            print(f"{RED}Тебе побачив солдат HECU та розстліляв на місці.")
            exit()
            
        else:
            print(f"{MAGENTA}Ти або нажав ентер, або написав щось інше, напиши цифри від одного до трьох. \n")
            
    
def scientist():
    
    print(f"{BLUE}Що робити з військовим - вирішуй сам, дружбанчік :D \n")
    
    while True:
        
        print(f"{RED}1. Вистрілити йому у голову та забрати його MP5 та патрони. ")
        print(f"{GREEN}2. Не тратити патрони та підійти на кортах та зламати йому шию. ")
        print(f"{YELLOW}3. Кричати {"Гей! Я тут!! Допоможіть!!"}")
      
        choise = input(f"{MAGENTA}Вибери число від одного до трьох. \n")

        if choise == "1":
            print(f"{CYAN} Ти вбив воєнного HECU та зустрів вченого який був у воєнного у полоні.")
            freakman_base()
            break
        
        elif choise == "2":
            print(f"{CYAN} Ти успішно зламав його шию та зекономив патрони, ще зустрів вченого який був у нього в полоні.")
            freakman_base()
            break
        
        elif choise == "3":
            print(f"{RED} На тебе подивились як на дебіла та розстріляли. \n")
            exit()
            
            
        else:
            print(f"{MAGENTA}Ти або нажав ентер, або написав щось інше, напиши цифри від одного до трьох. \n")
            
    
def freakman_base():       
    print(f"{BLUE} Ти освобождаєш вченого та він тебе дає бонус, {MAGENTA}Ключ-карта виходу з комплексу.")
    print(f"{BLUE} Ви знаходите військовий хаммер та парочку біля нього трупів вчених.")
        
    while True:

        
        print(f"{RED}1. Ви вдвоєм запригуєте у хаммер та їдете шукати вихід.")
        print(f"{GREEN}2. Ви йдете пєшком замість хаммера.")
        print(f"{YELLOW}3. Ви ждете до ночі з вченим.")
        
        choise = input(f"{MAGENTA}Введи число від одного до трьох: \n")
        
        if choise == "1":
            print(f"{CYAN} Ви успішно добераєтесь до свєрх сєкрєтної бази на якому знаходиться Гордон Фрікмен.")
            gordon_freakman()
            break
        elif choise == "2":
            print(f"{RED} Ви не успіваєте бистро добратись пєшком та вас вбивають інопланетні істоти.")
            exit()
        elif choise == "3":
            print(f"{RED} Вас знаходять воєнні та розстрілюють.")
            exit()
            
        else:
            print(f"{MAGENTA} Ти або нажаб ентер, або написав щось інше, введи число від одного до трьох. \n")
            
def gordon_freakman():    
        
    print(f"{BLUE} Гордон Фрікмен успішно вас як друзів зустрічає та ви з ним знайомитесь.")
    print(f"{BLUE} Він принімає вас у склад {LIGHTYELLOW_EX}{"ЛЯМБДА"}\n")
        
    print(f"{BLUE} Гордон Фрікмен на язикє жестів позвав вас піти на тір та ви з ним пішли, вченого оставілі сідєть на базі.")
    print(f"{BLUE} Раптом Гордон Фрікмен пропадає та на полу лежить монтіровка. \n")
        
    crowbar_freakman()
     
def crowbar_freakman():  
        
    while True:
    
        
        print(f"{RED}1. Забрати монтіровку Гордона Фрікмена.")
        print(f"{GREEN}2. Не забирати його монтіровку та йти далі.")
        print(f"{YELLOW}3. Викликати на допомогу Джимена. \n")
        
        choise = input(f"{MAGENTA}Введи число від одного до трьох: \n")
        
        if choise == "1":
            print(f"{RED} Гордон Фрікмен повертається та вбиває тебе за то шо ти вклав його монтіровку.")
            exit()
        elif choise == "2":
            print(f"{CYAN} Гордон Фрікмен повертається та ви далі йдете по його базі.")
            shooting_range()
            break
        elif choise == "3":
            print(f"{GREEN} Тебе вбивають солдати Гордона Фрікмена за то шо ти викликаєш ")
            exit()
            
        else:
            print(f"{MAGENTA}\nТи або нажав ентер, або написав щось інше, напиши цифри від одного до трьох.\n")
            
def shooting_range():
    print(f"{BLUE} Ви підходете к тіру та заходете в нього.")    
    print(f"{BLUE} Гордон Фрікмен бере ракетницю та дає вам пістолет.\n")
    print(f"{BLUE} З бази дістяються раптом постріли з інших крилів та відбуваються взриви.")
    print(f"{BLUE} Гордон дає вам ракетницю замість пістолета, та ви йдете захищати базу.\n")
    print(f"{BLUE} На базу проник ворожий танк солдатів HECU.\n")

    while True:
        print(f"{RED} 1. З допомогою ракетниці вистрілити у танк.")
        print(f"{GREEN} 2. Розрядити ракетницю та напасти без зброї на танк.")
        print(f"{YELLOW} 3. Нічого не робити. \n")
                
        choise = input(f"{MAGENTA}Введи число від одного до трьох: \n")
        
        if choise == "1":
            print(f"{CYAN} Ти ліквідував танк, але постраждали люди.")
            health_people()
            break
        elif choise == "2":
            print(f"{RED} Вас успівають вбити HECUшники.")
            exit()
        elif choise == "3":
            print(f"{RED} Гордон Фрікмен розбиває вам голову монтіровкою тому що ви лєнтяй.")
            exit()
        else:
            print(f"{MAGENTA} Ти нажав ентер, або ввів не число, будь-ласка, від одного до трьох числа. \n")
            
def health_people():
    
    while True:
        print(f"{BLUE} Гордон Фрікмен дякує вам за допомогу, але во круг багато ранених союзників.")
        print(f"{BLUE} Поруч з фрікменом багато аптечок.")

        print(f"{RED} 1. Швидко взяти аптєчки да розкидати всім солдатам та підхилити їх.")
        print(f"{GREEN} 2. По стелсу вбити Гордона Фрікмена та зліняти звідси.")
        print(f"{YELLOW} 3. Добити поранених союзників Гордона Фрікмена. \n")

        choise = input(f"{MAGENTA} Введи число від одного до трьох: \n")
        
        if choise == "1":
            print(f"{CYAN} Ви підхилили солдат, вони вам аплодірують разом з Гордоном Фрікменом.")
            the_end()
            break
        elif choise == "2":
            print(f"{CYAN} Ви вбили гордона, та ви збіжали з його бази.")
            the_end()
            break
        elif choise == "3":
            print(f"{RED} Гордон Фрікмен вбиває вас за таку халатність. ")
            exit()
            
        else:
            print(f"{MAGENTA}Ти щось ввів не те, введи числа бляха!!")

def the_end():
    while True:
        print(f"{BLUE}У вас є можливість збіжати з комплексу, ви нею зможете зкористуватися з помощью ключ-карти.")
        print(f"{BLUE}Ви виходите з бази гордона, та прямуєте на вихід.\n")
        
        print(f"{RED}1. Швидко біжати до вихіду, та відкрити ворота і збіжати з комплексу.")
        print(f"{GREEN}2. Не йти на вихід та викінути ключ-карту.")
        print(f"{YELLOW}3. Ви вбиваєте самого себе. \n")
        
        choise = input(f"{MAGENTA} Введіть число від одного до трьох бляха: \n")
        
        if choise == "1":
            print(f"{CYAN} Ти вибрався з комплексу та закінчив гру! Дякую за проходження цієї гри!!!")
            exit()
        elif choise == "2":
            print(f"{RED} Тебе збили хекушники по дорозі.")
            exit()
        elif choise == "3":
            print(f"{RED} Ти вбив самого себе, навіщо ти це зробив???")
            exit()
        else:
            print(f"{MAGENTA} Введи число від одного до трьох, будь-ласка: \n")
        
full_game()
        

 