import colorama
colorama.init(autoreset= True)
RESET = colorama.Fore.RESET

RED = colorama.Fore.RED
GREEN = colorama.Fore.GREEN
BLUE = colorama.Fore.BLUE
YELLOW = colorama.Fore.YELLOW
MAGENTA = colorama.Fore.MAGENTA
CYAN = colorama.Fore.CYAN
WHITE = colorama.Fore.WHITE
BLACK = colorama.Fore.BLACK

print(f"{BLUE} Привіт друже! Ти знаходишся у моєй грі про поїзд!")
print(f"{BLUE} Ти знаходишся у маленькій дєрєвні з зомбі.")
print(f"{BLUE} Ти у домі, поруч з тобою лежить окровавлений лом, та труп.")
print(f"{BLUE} Що робити - вибираєш сам :D\n ")    

print(f"{RED}1. Узяти лом та вибратись з дому.")
print(f"{GREEN}2. Не брати лом та вибратись з дому.")
print(f"{YELLOW}3. Не вибиратись з дому \n")


the_house = input(f"{MAGENTA} Вибери числа від одного до трьох: ")

if the_house == "1":
    print(f"{CYAN} Ти успішно вибрався з дому, та побачив старий красний амбар.")
    
elif the_house == "2":
    print(f"{RED} На дворі було так багато зомбі, вас зʼїли.")
    exit()
    
elif the_house == "3":
    print(f"{RED} Ви померли з голоду.")
    exit()
    
else:
    print(f"{MAGENTA} Ви щось не те ввели, запустіть код снова.")
    exit()

        
print(f"{BLUE} Що робити з амбаром - вирішуй сам :)) \n")
print(f"{RED}1. Швидко забіжати у амбар прориваясь через зомбаков.")
print(f"{GREEN}2. Нічого не робити та не забігати у амбар. \n")
the_ambar = input(f"{MAGENTA}Вибери числа від одного до трьох: ")
if the_ambar == "1":
    print(f"{CYAN}Ти забіжав до амбару та закрив двері, оглянувся та вияснилось що в амбарі нікого не було крім старенького пікапа. \n")
elif the_ambar == "2":
    print(f"{RED} Тебе з'їли зомбі. \n")
    exit()   
else: 
    print(f"Ви щось не те ввели, спробуйте ще-раз.")    


print(f"{BLUE} Пікап був з відкритою двер'ю якшо шо, та на задньому сидінні була автомабична гвинтівка {f'{RED}М4'}.")
print(f"{RED}1. Сісти у пікап та забрати М4, спробувати запустити двигун старого пікапа.")
print(f"{GREEN}2. Вибіжати з амбару :) ")
print(f"{YELLOW}3. Дождатись ночі в амбарі.")
the_car = input(f"{BLUE} Вибери числа від одного до трьох: ")
if the_car == "1":
    print(f"{CYAN} Ти сів у пікап та забрав М4. Попитався завести двігун, та запустив двигун :)) \n")
    
elif the_car == "2":
    print(f"{RED} Ви відкрили амбар та вас з'їли зомбі того шо ви дурень :((( \n")
    exit()
elif the_car == "3":
    print(f"{RED} Зомбі виламали амбар та напали на тебе, ти не зміг нічого робити. \n")
    exit()
else:
    print(f"{MAGENTA} Ви щось не те ввели, запустіть код снова.")

print(f"{BLUE} Що робити з пікапом - вирішуй сам. \n")
print(f"{RED}1. Натиснути на газ та роздалбати забарікадіровані ворота амбару.")
print(f"{GREEN}2. Вийти з пікапу та відкрити двері амбару, та сісти у пікам та виїхати. \n")
street_pickup = input(f"{MAGENTA} Введи чісла від одного до трьох: ")

if street_pickup == "1":
    print(f"{RED} Ви протаранили ворота амбара, але ваш пікап перегорнувся, ви утратили сознание.")
    exit()
elif street_pickup == "2":
    print(f"{CYAN} Ви швидко виїхали з амбару, та заїхали на трасу.")
else:
    print(f"{MAGENTA} Ви щось не те ввели, запустіть код снова.")
    

print(f"{BLUE} Ти бачиш на дорозі дуже багато покинутів автомобілів.")
print(f"{BLUE} Ти аккуратно проїзджаєш їх, та раптом з твоєї машини роздається радіо:\n {f'{YELLOW}Всім вижившим!!! В поліцейському участці нашого города евакуація!'}")
print(f"{BLUE} Раптом роздаються вистріли в твою машину, вона перегортається, ти відключаєшся.\n")
print(f"{BLUE} Ти прокидаєшся, ти лежиш у камері на ліжку, але в тебе немає автомата та лома.")
print(f"{BLUE} Двері відкриваются та входить в камеру чоловік зі свинячою головою та з топором, він на тебе намахується, вибір за тобою: \n")

print(f"{RED}1. Уклонитися від його удару, вибіжати з камери та закрити його там.")
print(f"{GREEN}2. Уклонитися та почати битися з ним.")
print(f"{YELLOW}3. Прикинутися мертвим.")

the_prison = input(f"{MAGENTA} Введіть числа від одного до трьох: ")

if the_prison == "1":
    print(f"{CYAN} Ти закрив його у прочній камері, ти молодець :)) позаду тебе була сумка з твоїм ломом та автоматом.")
    
elif the_prison == "2":
    print(f"{RED} Своїм гігантським топором він розрубив твою голову.")
    exit()
    
elif the_prison == "3":
    print(f"{RED} Він вбиває своїм топором без проблем.")
    exit()
else:
    print(f"{MAGENTA}Ви щось не те ввели, запустіть код снова.")
    
print(f"{BLUE} Ти береш свої речі назад, але роздаються шаги в коридорі, зʼявляється другий мужик зі свинячою головою та топором.\n")

print(f"{RED}1. Дістати лом та почати бити його в рукопашну.")
print(f"{GREEN}2. Дістати автомат та почати стріляти в нього.")
print(f"{YELLOW}3. Бігти від нього та не оглядатися.\n")

second_enemy = input(f"{MAGENTA}Введи числа від одного до трьох: ")
    


if second_enemy == "1":
    print(f"{RED} Він віджав у тебе лом та вбив тебе топором.")
    exit()
elif second_enemy == "2":
    print(f"{CYAN}Ти розстріляв йому бошку, він падає з на землю з кучою крові по всюду, ти спокійно йдеш назад та зустрічаєш кімнату.")
    
elif second_enemy == "3":
    print(f"{RED} Мужик кидає в тебе топор та тебе вбиває.")
    exit()
else: 
    print(f"{MAGENTA} Ви щось не те ввели, запустіть код снова.")
    exit()
    
print(f"{BLUE} Ця кімната оказується гаражом, в ній знаходиться червоний седан тих головорізів, він повністю заправлен.\n")
print(f"{RED}1. Сісти у седан та виїхати з цієї маленької тюрьми на трассу.")
print(f"{GREEN}2. Застрелити самого себе.")

sedun_street = input(f"{MAGENTA} Введіть числа від одного до трьох: ")

if sedun_street == "1":
    print(f"{CYAN} Ти виїжджаєш на трасу, та бачиш блок-пост з воєнними та поліцейським участком.")
elif sedun_street == "2":
    print(f"{RED}2. Ти застрелив самого себе, і навіщо ти це зробив?")
    exit()
else: 
    print(f"{MAGENTA} Ви щось не те ввели, запустіть код снова.")
    exit()

print(f"{BLUE} Воєнні бачуть твою машину, вони дістають мегафон та говорять тобі остановити авто.")
print(f"{RED}1. Зажати газ та вʼїхати у воєнних на всій скорості.")
print(f"{GREEN}2. Остановити авто.")

outpost_evacuation = input(f"{MAGENTA}Введи числа від одного до трьох: ")

if outpost_evacuation == "1":
     print(f"{RED} Ви зробили ДТП, навіщо ви це вибрали?")
     exit()
elif outpost_evacuation == "2":
    print(f"{CYAN} Ти виходиш з машини з піднятими руками, воєнні тебе обшукують та проводять на поліцейський участок.")
else:
    print(f"{MAGENTA} Ви щось не те ввели, запустіть код снова.")
    
print(f"{BLUE} На вертольотну площадку прилітає евакуаційний вертоліт, у вас є вибір задитись в нього чи ні: ")
print(f"{RED}1. Сісти у вертоліт та завершити історію.")
print(f"{GREEN}2. Не сідати у вертоліт та бути військовим.")

helicopter = input(f"{MAGENTA}Введіть числа від одного до трьох: ")

if helicopter == "1":
    print(f"{GREEN} Ви потрапили на хорошу кінцівку та вибрались з зомбі-города, дякую за гру!")
    exit()
elif helicopter == "2":
    print(f"{YELLOW} Ви потрапили на середню кінцівку та стали військовим, захищати поліцейський участок від зомбаков.")
    exit()
else:
    print(f"{MAGENTA}3. Ви щось не те ввели, запустіть код снова.")