import colorama

colorama.init(autoreset=True)

BLUE = colorama.Fore.BLUE
RED = colorama.Fore.RED
GREEN = colorama.Fore.GREEN
YELLOW = colorama.Fore.YELLOW
MAGENTA = colorama.Fore.MAGENTA
CYAN = colorama.Fore.CYAN
LIGHTYELLOW_EX = colorama.Fore.LIGHTYELLOW_EX

QUESTS = {
    "start": {
        "text": f"{BLUE} Раптом ти прокидаєшся у крові, поруч з тобою пістолет Глок-17 та твій мертвий напарник.",
        "choises": {
            "1": f"{RED}1. Взяти пістолет та втекти з блок-поста.",
            "2": f"{GREEN}2. Вистрілити у себе в голову.",
            "3": f"{YELLOW}3. Не брати пістолет та втекти у сам комплекс. \n"
        },
        "actions": {"1": "next_def", "2": "death", "3": "death"},
        "trans": {
            "1": "scientist",
            "2": "Ти вистрілив собі у голову та помер.",
            "3": "Ти втік у комплекс без всього та був вбитий снайпером."
        }
        
    },
    "scientist": {
        "text": f"{BLUE} Ти добіг до оружейного складу та побачив військового HECU \n Що робити з військовим - вирішуй сам друже :DD",
        "choises": {
            "1": f"{RED}1. Вистрілити йому у голову та забрати його MP5 та патрони.",
            "2": f"{GREEN}2. Не витрачувати патрони та підійти на кортах та зламати йому шию. ",
            "3": f"{YELLOW}3. Кричати {'Гей! Я тут!! Допоможіть!!'}"
        },
        "actions": {"1": "next_def", "2": "next_def", "3": "death"},
        "trans": {
            "1": "freakman_base",
            "2": "Ти успішно зламав його шию та зекономив патрони, ще зустрів вченого який був у нього в полоні.",
            "3": "На тебе подивились як на дебіла та розстріляли. \n"
        }
        
    },
    "freakman_base": {
        "text": f"{BLUE} Ти освобождаєш вченого та він тебе дає бонус, {MAGENTA}Ключ-карта виходу з комплексу.\n Ви знаходите військовий хаммер та парочку біля нього трупів вчених.",
        "choises": {
            "1": f"{RED}1. Ви вдвоєм запригуєте у хаммер та їдете шукати вихід.",
            "2": f"{GREEN}2. Ви йдете пєшком замість хаммера.",
            "3": f"{YELLOW}3. Ви ждете до ночі з вченим."
        },
        "actions": {"1": "next_def", "2": "death", "3": "death"},
        "trans": {
            "1": "gordon_freakman",
            "2": "Ви не успіваєте бистро добратись пєшком та вас вбивають інопланетні істоти.",
            "3": "Вас знаходять воєнні та розстрілюють."
        }
        
    },
    
    "gordon_freakman": {
        "text": f"{BLUE}Гордон Фрікмен успішно вас як друзів зустрічає та ви з ним знайомитесь.\n"
                f"Він приймає вас у склад {LIGHTYELLOW_EX}ЛЯМБДА\n\n"
                f"{BLUE}Гордон Фрікмен на язику жестів позвав вас піти на тир, а вченого залишили сидіти на базі.\n"
                f"Раптом Гордон Фрікмен пропадає, а на підлозі лежить монтування.",
        "choises": {
            "1": f"{RED}1. Забрати монтування Гордона Фрікмена.",
            "2": f"{GREEN}2. Не забирати його монтування та йти далі.",
            "3": f"{YELLOW}3. Викликати на допомогу Джимена.\n"
        },
        "actions": {"1": "death", "2": "next_def", "3": "death"},
        "trans": {
            "1": "Гордон Фрікмен повертається та вбиває тебе за те, що ти взяв його монтування.",
            "2": "shooting_range",
            "3": "Тебе вбивають солдати Гордона Фрікмена за те, що ти викликаєш ворогів."
        }
    },
    
    "shooting_range": {
        "text": f"{BLUE}Ви підходите до тиру та заходите в нього.\n"
                f"Гордон Фрікмен бере ракетницю та дає вам пістолет.\n"
                f"З бази чути постріли та відбуваються вибухи.\n"
                f"Гордон дає вам ракетницю замість пістолета, і ви йдете захищати базу.\n"
                f"На базу проник ворожий танк солдатів HECU.",
        "choises": {
            "1": f"{RED}1. З допомогою ракетниці вистрілити у танк.",
            "2": f"{GREEN}2. Розрядити ракетницю та напасти без зброї на танк.",
            "3": f"{YELLOW}3. Нічого не робити.\n"
        },
        "actions": {"1": "next_def", "2": "death", "3": "death"},
        "trans": {
            "1": "health_people",
            "2": "Вас успівають вбити HECUшники.",
            "3": "Гордон Фрікмен розбиває вам голову монтуванням, тому що ви лентяй."
        }
    },
    
    "health_people": {
        "text": f"{BLUE}Ти ліквідував танк, але постраждали люди.\n"
                f"Гордон Фрікмен дякує вам за допомогу, але навколо багато поранених союзників.\n"
                f"Поруч з Фрікменом багато аптечок.",
        "choises": {
            "1": f"{RED}1. Швидко взяти аптечки та розкидати всім солдатам та підхілити їх.",
            "2": f"{GREEN}2. По стелсу вбити Гордона Фрікмена та зліняти звідси.",
            "3": f"{YELLOW}3. Добити поранених союзників Гордона Фрікмена.\n"
        },
        "actions": {"1": "next_def", "2": "next_def", "3": "death"},
        "trans": {
            "1": "the_end",
            "2": "the_end",
            "3": "Гордон Фрікмен вбиває вас за таку халатність."
        }
    },
    
    "the_end": {
        "text": f"{BLUE}У вас є можливість збіжати з комплексу за допомогою ключ-карти.\n"
                f"Ви виходите на фінішну пряму і бачите головні ворота.",
        "choises": {
            "1": f"{RED}1. Швидко бігти до виходу, відкрити ворота і збіжати з комплексу.",
            "2": f"{GREEN}2. Не йти на вихід та викинути ключ-карту.",
            "3": f"{YELLOW}3. Ви вбиваєте самого себе.\n"
        },
        "actions": {"1": "win", "2": "death", "3": "death"},
        "trans": {
            "1": "Ти вибрався з комплексу та закінчив гру! Дякую за проходження цієї гри!!!",
            "2": "Тебе збили хекушники по дорозі.",
            "3": "Ти вбив самого себе, навіщо ти це зробив???"
        }
    }
}